Repository: GNOME/gnome-remote-desktop
Catalog: po/*.po
Languages: kk, ml, sr@latin, th

source: The VNC authentication method describes how a remote connection is authenticated. It can currently be done in two different ways: * prompt - by prompting the user for each new connection, requiring a person with physical access to the workstation to explicitly approve the new connection. * password - by requiring the remote client to provide a known password
kk: VNC аутентификация әдісі қашықтағы байланысты аутентификациялау әдісін сипаттайды. Қазіргі уақытта оны екі түрлі жолмен жасауға болады: * сұрау - пайдаланушыны әрбір жаңа байланысқа шақыру арқылы, жұмыс станциясына физикалық рұқсаты бар адамнан жаңа байланысты тікелей рұқсат етуді талап ету арқылы. * пароль - қашықтағы клиенттен белгілі парольді ұсынуды талап ету арқылы
ml: ഒരു വിദൂര കണക്ഷൻ എങ്ങനെ ആധികാരികമാക്കുന്നുവെന്ന് വിഎൻസി ഓതന്റിക്കേഷൻ രീതി വിവരിക്കുന്നു. ഇത് നിലവിൽ രണ്ട് വ്യത്യസ്ത രീതികളിൽ ചെയ്യാൻ കഴിയും: * prompt - ഓരോ പുതിയ കണക്ഷനും ഉപയോക്താവിനെ പ്രേരിപ്പിക്കുന്നതിലൂടെ, വർക്ക്സ്റ്റേഷനിലേക്ക് ശാരീരിക പ്രവേശനമുള്ള ഒരു വ്യക്തി പുതിയ കണക്ഷൻ വ്യക്തമായി അംഗീകരിക്കേണ്ടതുണ്ട്. * password - അറിയപ്പെടുന്ന ഒരു പാസ് വേഡ് നൽകാൻ വിദൂര ക്ലയന്റിനോട് ആവശ്യപ്പെടുന്നതിലൂടെ
sr@latin: Način potvrde identiteta VNC veza opisuje kako se udaljena veza autentifikuje. Trenutno se to može uraditi na dva načina: * prompt - pita korisnika za svaku novu vezu, zahteva osobu sa fizičkim pristupom radnoj stanici da bi se svaka nova veza eksplicitno odobrila. * password - zahteva od udaljenog klijenta da dostavi postojeću lozinku
th: วิธีการยืนยันตัวตน VNC อธิบายถึงวิธีการยืนยันตัวตนสำหรับการเชื่อมต่อระยะไกล ซึ่งปัจจุบันสามารถทำได้ 2 วิธี: * prompt - ด้วยการพรอมต์ผู้ใช้ในการเชื่อมต่อแต่ละครั้ง โดยต้องให้บุคคลที่สามารถเข้าถึงเครื่องเวิร์กสเตชันจริงทำการอนุมัติการเชื่อมต่อใหม่อย่างชัดเจน * password - ด้วยการให้ไคลเอนต์ระยะไกลระบุรหัสผ่านที่ทราบ

source: Screenshare mode of VNC connections
kk: VNC байланыстарының экранды бөлісу режимі
ml: വിഎൻസി കണക്ഷനുകളുടെ സ്ക്രീൻഷെയർ മോഡ്
sr@latin: Režim deljenja ekrana za VNC veze
th: โหมดการใช้หน้าจอร่วมกันของการเชื่อมต่อ VNC

source: The screenshare mode specifies, whether the VNC backend mirrors the primary screen, or whether a virtual monitor is created. For the initial resolution of the virtual monitor, the VNC backend uses a default size of 1920x1080 pixels. When using a remote desktop session with a virtual monitor, clients can resize the resolution of the virtual monitor during a session with the setDesktopSize PDU. Allowed screenshare modes include: * mirror-primary - Record the primary monitor of the current user session. * extend - Create a new virtual monitor and use it for the remote desktop session. The initial monitor resolution of this virtual monitor is set to 1920x1080 pixels. Clients can override the initial resolution with subsequent monitor configuration updates.
kk: Экранды бөлісу режимі VNC бэкенді негізгі экранды қосарлай ма, немесе виртуалды мониторды жасай ма, соны анықтайды. Виртуалды монитордың бастапқы ажыратымдылығы үшін VNC бэкенді әдепкі 1920x1080 пиксель өлшемін қолданады. Виртуалды монитормен қашықтағы жұмыс үстелі сессиясын пайдалану кезінде, клиенттер setDesktopSize PDU арқылы сессия барысында виртуалды монитордың ажыратымдылығын өзгерте алады. Рұқсат етілген экранды бөлісу режимдеріне мыналар кіреді: * mirror-primary - Ағымдағы пайдаланушы сессиясының негізгі мониторын жазу. * extend - Жаңа виртуалды монитор жасау және оны қашықтағы жұмыс үстелі сессиясы үшін пайдалану. Бұл виртуалды монитордың бастапқы монитор ажыратымдылығы 1920x1080 пиксель етіп орнатылады. Клиенттер бастапқы ажыратымдылықты кейінгі монитор конфигурациясының жаңартуларымен қайта анықтай алады.
ml: വിഎൻസി ബാക്കെൻഡ് പ്രൈമറി സ്ക്രീനിനെ മിറർ ചെയ്യുന്നുണ്ടോ, അല്ലെങ്കിൽ ഒരു വെർച്വൽ മോണിറ്റർ സൃഷ്ടിച്ചിട്ടുണ്ടോ എന്ന് സ്ക്രീൻഷെയർ മോഡ് വ്യക്തമാക്കുന്നു. വെർച്വൽ മോണിറ്ററിൻ്റെ പ്രാരംഭ റെസല്യൂഷനു വേണ്ടി, വിഎൻസി ബാക്കെൻഡ് 1920x1080 പിക്സലുകളുടെ ഡിഫോൾട്ട് സൈസ് ഉപയോഗിക്കുന്നു. ഒരു വെർച്വൽ മോണിറ്ററിനൊപ്പം ഒരു റിമോട്ട് ഡെസ്‌ക്‌ടോപ്പ് സെഷൻ ഉപയോഗിക്കുമ്പോൾ, setDesktopSize PDU ഉള്ള ഒരു സെഷനിൽ ക്ലയൻ്റുകൾക്ക് വെർച്വൽ മോണിറ്ററിൻ്റെ റെസല്യൂഷൻ വലുപ്പം മാറ്റാൻ കഴിയും. അനുവദനീയമായ സ്ക്രീൻഷെയർ മോഡുകളിൽ ഇവ ഉൾപ്പെടുന്നു: * mirror-primary - നിലവിലെ ഉപയോക്തൃ സെഷൻ്റെ പ്രാഥമിക മോണിറ്റർ രേഖപ്പെടുത്തുക. * extend - ഒരു പുതിയ വെർച്വൽ മോണിറ്റർ സൃഷ്‌ടിച്ച് റിമോട്ട് ഡെസ്‌ക്‌ടോപ്പ് സെഷനു വേണ്ടി ഉപയോഗിക്കുക. ഈ വെർച്വൽ മോണിറ്ററിൻ്റെ പ്രാരംഭ മോണിറ്റർ റെസലൂഷൻ 1920x1080 പിക്സലുകളായി സജ്ജീകരിച്ചിരിക്കുന്നു. തുടർന്നുള്ള മോണിറ്റർ കോൺഫിഗറേഷൻ അപ്‌ഡേറ്റുകൾ ഉപയോഗിച്ച് ക്ലയൻ്റുകൾക്ക് പ്രാരംഭ റെസല്യൂഷൻ അസാധുവാക്കാനാകും.
sr@latin: Režim deljenja ekrana navodi da li RDP pozadinac preslikava primarni ekran ili se pravi virtuelni ekran. Za početnu rezoluciju virtuelnog ekrana, RDP pozadinac koristi ili osnovne podatke klijenta ([MS-RDPBCGR] 2.2.1.3.2) ili podatke ekrana klijenta ([MS-RDPBCGR] 2.2.1.3.6), zavisno od toga šta je dostupno. Kada se koristi sesija udaljenog pristupa sa virtuelnim ekranom, klijenti mogu promeniti veličinu virtuelnog ekrana u toku sesije sa „setDesktopSize PDU“. Dozvoljeni režimi deljenja ekrana sadrže: * mirror-primary – snima primarni ekran trenutne korisničke sesije. * extend – pravi novi virtuelni ekran i koristi ga tokom sesije udaljenog pristupa. Rezolucija ovog virtuelnog ekrana se izvodi iz podešavanja ekrana, koje šalje klijent udaljenog pristupa.
th: โหมดการใช้หน้าจอร่วมกันจะระบุว่าแบ็กเอนด์ VNC จะสะท้อนหน้าจอหลัก หรือระบุว่าจะสร้างจอภาพเสมือนจริงหรือไม่ สำหรับความละเอียดเริ่มต้นของจอภาพเสมือน แบ็กเอนด์ VNC จะใช้ขนาดเริ่มต้นที่ 1920x1080 พิกเซล เมื่อใช้เซสชันเดสก์ท็อประยะไกลด้วยจอภาพเสมือนจริง ไคลเอนต์สามารถปรับขนาดความละเอียดของจอภาพเสมือนจริงระหว่างเซสชันได้ด้วย setDesktopSize PDU โหมดการใช้หน้าจอร่วมกันที่อนุญาตได้แก่: * mirror-primary - บันทึกจอภาพหลักของเซสชันผู้ใช้ปัจจุบัน * extend - สร้างจอภาพเสมือนใหม่และใช้จอภาพนั้นสำหรับเซสชันเดสก์ท็อประยะไกล ความละเอียดของจอภาพเสมือนนี้จะถูกตั้งไว้ที่ 1920x1080 พิกเซล โดยไคลเอนต์สามารถแทนที่ค่าความละเอียดนี้ได้ด้วยการปรับปรุงการกำหนดค่าจอภาพในภายหลัง

source: GNOME Remote Desktop Handover Daemon
ml: ഗ്നോം റിമോട്ട് ഡെസ്ക്ടോപ്പ് ഹാൻഡ്ഓവർ ഡെമൺ
sr@latin: Pozadinski program Gnomove udaljene radne površine
th: ดีมอนการส่งต่อเดสก์ท็อประยะไกล GNOME

source: rdp - RDP subcommands: set-port - Set port the server binds to enable - Enable the RDP backend disable - Disable the RDP backend set-tls-cert <path-to-cert> - Set path to TLS certificate set-tls-key <path-to-key> - Set path to TLS key set-credentials [<username> [<password>]] - Set username and password credentials clear-credentials - Clear username and password credentials enable-view-only - Disable remote control of input devices disable-view-only - Enable remote control of input devices enable-port-negotiation - If unavailable, listen to a different port disable-port-negotiation - If unavailable, don't listen to a different port
sr@latin: rdp - RDP podnaredbe: set-port - Podesite port na koji se server vezuje enable - Omogućava RDP pozadinca disable - Onemogućava RDP pozadinca set-tls-cert <path-to-cert> - Podešava putanju do TLS sertifikata set-tls-key <path-to-key> - Podešava putanju do TLS ključa set-credentials <username> <password> - Podešava akreditive za korisničko ime i lozinku clear-credentials - Čisti akreditive korisničkog imena i lozinke enable-view-only - Onemogućava udaljeno upravljanje ulaznih uređaja disable-view-only - Omogućava udaljeno upravljanje ulaznih uređaja
th: rdp - คำสั่งย่อยสำหรับ RDP: set-port - กำหนดพอร์ตที่จะให้เซิร์ฟเวอร์ผูกด้วย enable - เปิดใช้งานแบ็กเอนด์ RDP disable - ปิดใช้งานแบ็กเอนด์ RDP set-tls-cert <path-to-cert> - กำหนดพาธสำหรับใบรับรอง TLS set-tls-key <path-to-key> - กำหนดพาธสำหรับคีย์ TLS set-credentials [<username> [<password>]] - กำหนดข้อมูลลับชื่อผู้ใช้ และรหัสผ่าน clear-credentials - ล้างข้อมูลลับชื่อผู้ใช้ และรหัสผ่าน enable-view-only - ปิดใช้งานการควบคุมระยะไกลของ อุปกรณ์อินพุต disable-view-only - เปิดใช้งานการควบคุมระยะไกลของ อุปกรณ์อินพุต enable-port-negotiation - ถ้าไม่พร้อมใช้งาน ให้ฟัง พอร์ตอื่น disable-port-negotiation - ถ้าไม่พร้อมใช้งาน ไม่ต้องฟัง พอร์ตอื่น

source: status [--show-credentials] - Show current status Options: --headless - Use headless credentials storage --system - Configure system daemon --help - Print this help text
th: status [--show-credentials] - แสดงสถานะปัจจุบัน Options: --headless - ใช้หน่วยจัดเก็บข้อมูลลับแบบ headless --system - กำหนดค่าดีมอนระบบ --help - พิมพ์ข้อความวิธีใช้นี้

source: Allow to configure gnome-remote-desktop's system daemon settings.
ml: Gnome-remote-desktop's system daemon settings കോൺഫിഗർ ചെയ്യാൻ അനുവദിക്കുക.

source: Authentication is required to configure gnome-remote-desktop's system daemon settings.
ml: Gnome-remote-desktop-ൻ്റെ സിസ്റ്റം ഡെമൺ ക്രമീകരണങ്ങൾ ക്രമീകരിക്കുന്നതിന് ആധികാരികത ആവശ്യമാണ്.

source: This connection is insecure
ml: ഈ ബന്ധം അരക്ഷിതമാണ്

source: Do you want to continue with an insecure connection? To make it secure set <b>“use redirection server name:i:1”</b> in the RDP config file.
ml: നിങ്ങൾക്ക് സുരക്ഷിതമല്ലാത്ത കണക്ഷനുമായി തുടരണോ? ഇത് സുരക്ഷിതമായി സജ്ജമാക്കാൻ <b>“use redirection server name:i:1”</b> RDP കോൺഫിഗറേഷൻ ഫയലിൽ.
