Repository: GNOME/gnome-remote-desktop
Catalog: po/*.po
Languages: kk, ml, sr@latin, th

source: Allow to configure gnome-remote-desktop's system daemon settings
kk: gnome-remote-desktop жүйелік қызметінің баптауларын өзгертуге рұқсат беру
sr@latin: Dozvoljava podešavanje pozadinskog programa Gnomove udaljene radne površine
th: อนุญาตให้กำหนดการตั้งค่าดีมอนระบบของ gnome-remote-desktop

source: Authentication is required to configure gnome-remote-desktop's system daemon settings
kk: gnome-remote-desktop жүйелік қызметінің баптауларын өзгерту үшін аутентификация қажет
sr@latin: Prijava je potrebna za podešavanje podešavanje pozadinskog programa Gnomove udaljene radne površine
th: ต้องยืนยันตัวตนเพื่อกำหนดการตั้งค่าดีมอนระบบของ gnome-remote-desktop

source: Allow to enable and disable gnome-remote-desktop's system daemon
kk: gnome-remote-desktop жүйелік қызметін іске қосуға және сөндіруге рұқсат беру
sr@latin: Omogućava uključivanje i isključivanje pozadinskog programa Gnomove udaljene radne površine
th: อนุญาตเพื่อเปิดและปิดใช้งานดีมอนระบบของ gnome-remote-desktop

source: Authentication is required to enable or disable gnome-remote-desktop's system daemon
kk: gnome-remote-desktop жүйелік қызметін іске қосу немесе сөндіру үшін аутентификация қажет
sr@latin: Prijava je potrebna za uključivanje ili iskučivanje pozadinskog programa Gnomove udaljene radne površine
th: ต้องยืนยันตัวตนเพื่อเปิดหรือปิดใช้งานดีมอนระบบของ gnome-remote-desktop

source: Usage: %s [OPTIONS...] COMMAND [SUBCOMMAND]...
kk: Қолданылуы: %s [ОПЦИЯЛАР...] КОМАНДА [ІШКІ КОМАНДА]...
sr@latin: Korišćenje: %s [OPCIJE...] NAREDBA [PODNAREDBA]...
th: วิธีใช้: %s [ตัวเลือก...] คำสั่ง [คำสั่งย่อย]...

source: Username:
kk: Пайдаланушы аты:
sr@latin: Korisničko ime:
th: ชื่อผู้ใช้:

source: Password:
kk: Пароль:
sr@latin: Lozinka:
th: รหัสผ่าน:

source: Commands:
kk: Командалар:
ml: കമാൻഡുകൾ:
sr@latin: Naredbe:
th: คำสั่ง:

source: rdp - RDP subcommands: set-port - Set port the server binds to enable - Enable the RDP backend disable - Disable the RDP backend set-auth-methods <list-of-methods> - Set a comma separated list of allowed authentication methods (credentials, kerberos) set-tls-cert <path-to-cert> - Set path to TLS certificate set-tls-key <path-to-key> - Set path to TLS key set-kerberos-keytab <path-to-keytab> - Set path to a Kerberos keytab set-credentials [<username> [<password>]] - Set username and password credentials clear-credentials - Clear username and password credentials enable-view-only - Disable remote control of input devices disable-view-only - Enable remote control of input devices enable-port-negotiation - If unavailable, listen to a different port disable-port-negotiation - If unavailable, don't listen to a different port
kk: rdp - RDP ішкі командалары: set-port - Сервер байланысатын портты орнату enable - RDP бэкендін іске қосу disable - RDP бэкендін сөндіру set-auth-methods <list-of-methods> - Рұқсат етілген аутентификация әдістерінің үтірмен бөлінген тізімін орнату (credentials, kerberos) set-tls-cert <path-to-cert> - TLS сертификатына жолды орнату set-tls-key <path-to-key> - TLS кілтіне жолды орнату set-kerberos-keytab <path-to-keytab> - Kerberos keytab файлына жолды орнату set-credentials [<username> [<password>]] - Пайдаланушы аты мен пароль тіркелгі мәліметтерін орнату clear-credentials - Пайдаланушы аты мен пароль тіркелгі мәліметтерін тазарту enable-view-only - Енгізу құрылғыларын қашықтан басқаруды сөндіру disable-view-only - Енгізу құрылғыларын қашықтан басқаруды іске қосу enable-port-negotiation - Қолжетімсіз болса, басқа портты тыңдау disable-port-negotiation - Қолжетімсіз болса, басқа портты тыңдамау

source: vnc - VNC subcommands: set-port - Set port the server binds to enable - Enable the VNC backend disable - Disable the VNC backend set-password [<password>] - Set the VNC password clear-password - Clear the VNC password set-auth-method password|prompt - Set the authorization method enable-view-only - Disable remote control of input devices disable-view-only - Enable remote control of input devices enable-port-negotiation - If unavailable, listen to a different port disable-port-negotiation - If unavailable, don't listen to a different port
kk: vnc - VNC ішкі командалары: set-port - Сервер байланысатын портты орнату enable - VNC бэкендін іске қосу disable - VNC бэкендін сөндіру set-password [<password>] - VNC паролін орнату clear-password - VNC паролін тазалау set-auth-method password|prompt - Авторизация әдісін орнату enable-view-only - Енгізу құрылғыларын қашықтан басқаруды сөндіру disable-view-only - Енгізу құрылғыларын қашықтан басқаруды іске қосу enable-port-negotiation - Қолжетімсіз болса, басқа портты тыңдау disable-port-negotiation - Қолжетімсіз болса, басқа портты тыңдамау
sr@latin: vnc - VNC podnaredbe: set-port - Podesite port na koji se server vezuje enable - Omogućava VNC pozadinca disable - Onemogućava VNC pozadinca set-password <password> - Podešava VNC lozinku clear-password - Čisti VNC lozinku set-auth-method password|prompt - Podešava način autorizacije enable-view-only - Onemogućava udaljeno upravljanje ulaznim uređajima disable-view-only - Omogućava udaljeno upravljanje ulaznim uređajima enable-port-negotiation - Ukoliko nije dostupno, sluša drugi port disable-port-negotiation - Ukoliko nije dostupno ne sluša drugi port
th: vnc - คำสั่งย่อยสำหรับ VNC: set-port - กำหนดพอร์ตที่จะให้เซิร์ฟเวอร์ผูกด้วย enable - เปิดใช้งานแบ็กเอนด์ VNC disable - ปิดใช้งานแบ็กเอนด์ VNC set-password [<password>] - ตั้งรหัสผ่าน VNC clear-password - ล้างรหัสผ่าน VNC set-auth-method password|prompt - กำหนดวิธีการอนุญาต enable-view-only - ปิดใช้งานการควบคุมระยะไกลของ อุปกรณ์อินพุต disable-view-only - เปิดใช้งานการควบคุมระยะไกลของ อุปกรณ์อินพุต enable-port-negotiation - ถ้าไม่พร้อมใช้งาน ให้ฟัง พอร์ตอื่น disable-port-negotiation - ถ้าไม่พร้อมใช้งาน ไม่ต้องฟัง พอร์ตอื่น

source: status [--show-credentials] - Show current status Options: --headless - Configure headless daemon running on a user session --system - Configure system daemon for remote login --help - Print this help text
kk: status [--show-credentials] - Ағымдағы күйді көрсету Опциялар: --headless - Пайдаланушы сеансында орындалатын дисплейсіз демонды баптау --system - Қашықтан кіруге арналған жүйелік демонды баптау --help - Осы көмек мәтінін шығару
sr@latin: status [--show-credentials] - Prikazuje trenutno stanje Opcije: --headless - Podešava bezglavi pozadinski program radi na korisničkoj sesiji --system - Podešava pozadinski program sistema za udaljeno prijavljivanje --help - Prikazuje ovu poruku pomoći

source: GNOME Remote Desktop
kk: GNOME қашықтағы үстелі
ml: GNOME റിമോട്ട് ഡെസ്ക്ടോപ്പ്
sr@latin: Gnomova udaljena površina
th: ระบบเดสก์ท็อประยะไกลของ GNOME

source: Continue With Insecure Connection?
kk: Қауіпсіз емес байланысты жалғастыру керек пе?
sr@latin: Da nastavim sa nesigurnom vezom?
th: ดำเนินการต่อกับการเชื่อมต่อที่ไม่ปลอดภัยหรือไม่?

source: This Remote Desktop connection is insecure. To secure this connection, enable RDSTLS Security in your client by saving the connection settings in your client as an RDP file and set “use redirection server name:i:1” in it.
kk: Бұл қашықтағы жұмыс үстелі байланысы қауіпсіз емес. Бұл байланысты қауіпсіз ету үшін, клиентіңізде байланыс баптауларын RDP файлы ретінде сақтау арқылы RDSTLS қауіпсіздігін іске қосыңыз және оның ішінде «use redirection server name:i:1» мәнін орнатыңыз.
sr@latin: Ova veza do udaljene radne površina nije sigurna. Za sigurniju vezu, uključite RDSTLS sigurnost klijenta izmenom podešavanja veze unutar RDP datoteke, dodavanjem opcije „use redirection server name:i:1“.
th: การเชื่อมต่อเดสก์ท็อประยะไกลนี้ไม่ปลอดภัย เพื่อรักษาความปลอดภัยในการเชื่อมต่อนี้ ให้เปิดใช้งานการรักษาความปลอดภัย RDSTLS ในไคลเอนต์ของคุณโดยบันทึกการตั้งค่าการเชื่อมต่อในไคลเอนต์ของคุณเป็นไฟล์ RDP และตั้งค่า “use redirection server name:i:1” ในไฟล์นั้น

source: Disconnect
kk: Байланысты үзу
ml: വിച്ഛേദിക്കുക
sr@latin: Prekini vezu
th: ตัดการเชื่อมต่อ

source: Continue
kk: Жалғастыру
ml: തുടരുക
sr@latin: Nastavi
th: ดำเนินการต่อ

source: Desktop Sharing port changed
kk: Жұмыс үстелімен бөлісу порты ауысты
ml: ഡെസ്ക്ടോപ്പ് പങ്കിടൽ പോർട്ട് മാറ്റി
sr@latin: Port za deljenje radne površi je promenjen
th: พอร์ตการใช้เดสก์ท็อปร่วมกันถูกเปลี่ยน

source: The Desktop Sharing port has changed from <b>%i</b> to <b>%i</b>. This is because the Remote Sessions service has been activated and it has a higher priority to use port <b>%i</b>.
kk: Жұмыс үстелін ортақ пайдалану порты <b>%i</b> мәнінен <b>%i</b> мәніне өзгерді. Бұл Қашықтағы сеанстар қызметінің белсендірілуіне және оның <b>%i</b> портын пайдалануға басымдылығы жоғары болуына байланысты.
ml: ഡെസ്ക്ടോപ്പ് പങ്കിടൽ പോർട്ട് <b>%i</b> എന്നതിൽ നിന്ന് മാറി <b>%i</b> ആയി. റിമോട്ട് സെഷൻസ് സേവനം സജീവമാക്കിയതിനാലും <b>%i</b> പോർട്ട് ഉപയോഗിക്കുന്നതിന് ഉയർന്ന മുൻഗണനയുള്ളതിനാലുമാണ് ഇത്.
sr@latin: Port za deljenje radne površine je promenjen iz <b>%i</b> u <b>%i</b>. Ovo se desilo zato što je servis udaljene sesije akriviran i ima viši prioritet da koristi port <b>%i</b>.
th: พอร์ตการใช้เดสก์ท็อปร่วมกันได้ถูกเปลี่ยนจาก <b>%i</b> เป็น <b>%i</b> นี่เป็นเพราะบริการ Remote Sessions ได้ถูกเปิดใช้งานแล้ว และมีลำดับความสำคัญสูงกว่าในการใช้พอร์ต <b>%i</b>

source: Accept
kk: Қабылдау
ml: അംഗീകരിക്കുക
sr@latin: Prihvati
th: ยอมรับ

source: Do you want to share your desktop?
kk: Жұмыс үстелін ортақ пайдаланғыңыз келе ме?
ml: നിങ്ങളുടെ ഡെസ്ക്ടോപ്പ് പങ്കിടാൻ നിങ്ങൾ ആഗ്രഹിക്കുന്നുണ്ടോ?
sr@latin: Da li želite podeliti sadržaj vašeg ekrana?
th: คุณต้องการใช้เดสก์ท็อปของคุณร่วมกันหรือไม่?

source: A user on the computer '%s' is trying to remotely view or control your desktop.
kk: "%s" компьютеріндегі пайдаланушы жұмыс үстеліңізді қашықтан көруге немесе басқаруға талап жасап отыр.
ml: '%s' എന്ന കമ്പ്യൂട്ടറിലെ ഒരു ഉപയോക്താവ് നിങ്ങളുടെ ഡെസ്ക്ടോപ്പ് വിദൂരമായി കാണാനോ നിയന്ത്രിക്കാനോ ശ്രമിക്കുന്നു.
sr@latin: Korisnik na računaru „%s“ želi da udaljeno pregleda i upravlja vašom radnom površinom.
th: ผู้ใช้บนคอมพิวเตอร์ '%s' กำลังพยายามดูหรือควบคุมเดสก์ท็อปของคุณจากระยะไกล

source: Refuse
kk: Бас тарту
ml: നിരസിക്കുക
sr@latin: Odbij
th: ปฏิเสธ

source: The port used by the RDP server
kk: RDP сервері пайдаланатын порт
ml: RDP സെർവർ ഉപയോഗിക്കുന്ന പോർട്ട്
sr@latin: Port koji koristi RDP server
th: พอร์ตที่ใช้โดยเซิร์ฟเวอร์ RDP

source: The RDP client will connect to this port to use this RDP server.
kk: RDP клиенті осы RDP серверін пайдалану үшін осы портқа қосылады.
ml: ഈ RDP സെർവർ ഉപയോഗിക്കുന്നതിന് RDP ക്ലയൻ്റ് ഈ പോർട്ടിലേക്ക് ബന്ധിപ്പിക്കും.
sr@latin: RDP klijent će se povezati na ovaj port kako bi koristio RDP server.
th: ไคลเอนต์ RDP จะเชื่อมต่อกับพอร์ตนี้เพื่อใช้เซิร์ฟเวอร์ RDP นี้

source: Search a different RDP port if the configured one is used
kk: Егер бапталған порт пайдаланылып тұрса, басқа RDP портын іздеу
ml: കോൺഫിഗർ ചെയ്‌തത് ഉപയോഗിക്കുകയാണെങ്കിൽ മറ്റൊരു RDP പോർട്ട് തിരയുക
sr@latin: Potražite drugi RDP port ukoliko je podešeni port zauzet
th: ค้นหาพอร์ต RDP อื่นถ้าพอร์ตที่กำหนดค่าถูกใช้ไปแล้ว

source: When negotiate-port is set to 'true' the RDP server will attempt to listen to the first available of the next 10 ports starting from the configured one.
kk: negotiate-port мәні 'true' болып орнатылғанда, RDP сервері бапталған порттан бастап келесі 10 порттың ішіндегі бірінші қолжетімді портты тыңдауға тырысады.
ml: നെഗോഷ്യേറ്റ്-പോർട്ട് 'true'മായി സജ്ജമാക്കുമ്പോൾ, കോൺഫിഗർ ചെയ്ത ഒന്നിൽ നിന്ന് ആരംഭിക്കുന്ന അടുത്ത 10 പോർട്ടുകളിൽ ലഭ്യമായ ആദ്യത്തേത് കേൾക്കാൻ ആർഡിപി സെർവർ ശ്രമിക്കും.
sr@latin: Ukoliko je „negotiate-port“ postavljeno na „true“, RDP server će pokušati da sluša prvo dostupni port koji se nalazi u narednih 10 portova od podešenog.
th: เมื่อ negotiate-port ตั้งค่าเป็น 'true' เซิร์ฟเวอร์ RDP จะพยายามฟังพอร์ต 10 พอร์ตถัดไปชุดแรกที่พร้อมใช้งาน โดยเริ่มจากพอร์ตที่กำหนดค่าไว้

source: Whether the RDP backend is enabled or not
kk: RDP бэкенді іске қосылған ба, жоқ па
ml: RDP ബാക്കെൻഡ് പ്രവർത്തനക്ഷമമാക്കിയാലും ഇല്ലെങ്കിലും
sr@latin: Da li je RDP pozadinac omogućen ili ne
th: กำหนดว่าจะเปิดใช้งานแบ็กเอนด์ RDP หรือไม่

source: If set to 'true' the RDP backend will be initialized.
kk: Егер 'true' болып орнатылса, RDP бэкэнді инициализацияланады.
ml: 'true' എന്ന് ക്രമീകരിച്ചാൽ ആർഡിപി ബാക്ക്എൻഡ് ആരംഭിക്കും.
sr@latin: Ako je izabrano, RDP pozadinac biće pokrenut.
th: ถ้าตั้งค่าเป็น 'true' แบ็กเอนด์ RDP จะถูกตั้งต้น

source: Screenshare mode of RDP connections
kk: RDP байланыстарының экранды ортақ пайдалану режимі
ml: RDP കണക്ഷനുകളുടെ സ്ക്രീൻഷെയർ മോഡ്
sr@latin: Režim deljenja ekrana za RDP veze
th: โหมดการใช้หน้าจอร่วมกันของการเชื่อมต่อ RDP

source: The screenshare mode specifies, whether the RDP backend mirrors the primary screen, or whether a virtual monitor is created. For the initial resolution of the virtual monitor, the RDP backend uses either the client core data ([MS-RDPBCGR] 2.2.1.3.2) or the client monitor data ([MS-RDPBCGR] 2.2.1.3.6), depending on what is available. When using a remote desktop session with a virtual monitor, clients can resize the resolution of the virtual monitor during a session with the Display Update Virtual Channel Extension ([MS-RDPEDISP]). Allowed screenshare modes include: * mirror-primary - Record the primary monitor of the current user session. * extend - Create a new virtual monitor and use it for the remote desktop session. The resolution of this virtual monitor is derived from the monitor configuration, submitted by the remote desktop client.
kk: Экранды ортақ пайдалану режимі RDP бэкенді негізгі экранды қосарлай ма, немесе виртуалды монитор жасай ма, соны анықтайды. Виртуалды монитордың бастапқы ажыратымдылығы үшін RDP бэкэнді қолжетімділікке байланысты не клиенттің негізгі деректерін ([MS-RDPBCGR] 2.2.1.3.2), не клиенттің монитор деректерін ([MS-RDPBCGR] 2.2.1.3.6) пайдаланады. Виртуалды мониторы бар қашықтағы жұмыс үстелі сеансын пайдалану кезінде, клиенттер Display Update Virtual Channel Extension ([MS-RDPEDISP]) көмегімен сеанс кезінде виртуалды монитордың ажыратымдылығын өзгерте алады. Рұқсат етілген экранды ортақ пайдалану режимдеріне мыналар жатады: * mirror-primary - Ағымдағы пайдаланушы сеансының негізгі мониторын жазу. * extend - Жаңа виртуалды монитор жасау және оны қашықтағы жұмыс үстелі сеансы үшін пайдалану. Бұл виртуалды монитордың ажыратымдылығы қашықтағы жұмыс үстелі клиенті ұсынған монитор баптауларынан алынады.
ml: RDP ബാക്കെൻഡ് പ്രൈമറി സ്ക്രീനിനെ മിറർ ചെയ്യുന്നുണ്ടോ, അല്ലെങ്കിൽ ഒരു വെർച്വൽ മോണിറ്റർ സൃഷ്ടിച്ചിട്ടുണ്ടോ എന്ന് സ്ക്രീൻഷെയർ മോഡ് വ്യക്തമാക്കുന്നു. വെർച്വൽ മോണിറ്ററിൻ്റെ പ്രാരംഭ റെസല്യൂഷനു വേണ്ടി, ലഭ്യമായതനുസരിച്ച് RDP ബാക്കെൻഡ് ഒന്നുകിൽ ക്ലയൻ്റ് കോർ ഡാറ്റ ([MS-RDPBCGR] 2.2.1.3.2) അല്ലെങ്കിൽ ക്ലയൻ്റ് മോണിറ്റർ ഡാറ്റ ([MS-RDPBCGR] 2.2.1.3.6) ഉപയോഗിക്കുന്നു. ഒരു വെർച്വൽ മോണിറ്ററിനൊപ്പം വിദൂര ഡെസ്‌ക്‌ടോപ്പ് സെഷൻ ഉപയോഗിക്കുമ്പോൾ, ഡിസ്‌പ്ലേ അപ്‌ഡേറ്റ് വെർച്വൽ ചാനൽ എക്സ്റ്റൻഷൻ ([MS-RDPEDISP]) ഉള്ള ഒരു സെഷനിൽ ക്ലയൻ്റുകൾക്ക് വെർച്വൽ മോണിറ്ററിൻ്റെ റെസല്യൂഷൻ വലുപ്പം മാറ്റാനാകും. അനുവദനീയമായ സ്ക്രീൻഷെയർ മോഡുകളിൽ ഇവ ഉൾപ്പെടുന്നു: * മിറർ-പ്രൈമറി - നിലവിലെ ഉപയോക്തൃ സെഷൻ്റെ പ്രാഥമിക മോണിറ്റർ രേഖപ്പെടുത്തുക. * നീട്ടുക - ഒരു പുതിയ വെർച്വൽ മോണിറ്റർ സൃഷ്‌ടിച്ച് റിമോട്ട് ഡെസ്‌ക്‌ടോപ്പ് സെഷനു വേണ്ടി ഉപയോഗിക്കുക. റിമോട്ട് ഡെസ്ക്ടോപ്പ് ക്ലയൻ്റ് സമർപ്പിച്ച മോണിറ്റർ കോൺഫിഗറേഷനിൽ നിന്നാണ് ഈ വെർച്വൽ മോണിറ്ററിൻ്റെ റെസല്യൂഷൻ ഉരുത്തിരിഞ്ഞത്.
sr@latin: Režim deljenja ekrana određuje da li RDP pozadinac preslikava primarni ekran ili se pravi virtuelni ekran. Za početnu rezoluciju virtuelnog ekrana, RDP pozadinac koristi ili osnovne podatke klijenta ([MS-RDPBCGR] 2.2.1.3.2) ili podatke ekrana klijenta ([MS-RDPBCGR] 2.2.1.3.6), zavisno od toga šta je dostupno. Kada se koristi sesija udaljenog pristupa sa virtuelnim ekranom, klijenti mogu promeniti rezoluciju virtuelnog ekrana u toku sesije sa „Display Update Virtual Channel Extension“ ([MS-RDPEDISP]). Dozvoljeni režimi deljenja ekrana sadrže: * mirror-primary – snima primarni ekran trenutne korisničke sesije. * extend – pravi novi virtuelni ekran i koristi ga tokom sesije udaljenog pristupa. Rezolucija ovog virtuelnog ekrana se izvodi iz podešavanja ekrana, koje šalje klijent udaljenog pristupa.
th: โหมดการใช้หน้าจอร่วมกันจะระบุว่าแบ็กเอนด์ RDP จะสะท้อนหน้าจอหลัก หรือระบุว่าจะสร้างจอภาพเสมือนจริงหรือไม่ สำหรับความละเอียดเริ่มต้นของจอภาพเสมือน แบ็กเอนด์ RDP อาจใช้ข้อมูลแกนของไคลเอนต์ ([MS-RDPBCGR] 2.2.1.3.2) หรือข้อมูลจอภาพของไคลเอนต์ ([MS-RDPBCGR] 2.2.1.3.6) ขึ้นอยู่กับว่าข้อมูลใดพร้อมใช้งาน เมื่อใช้เซสชันเดสก์ท็อประยะไกลด้วยจอภาพเสมือนจริง ไคลเอนต์สามารถปรับขนาดความละเอียดของจอภาพเสมือนจริงระหว่างเซสชันได้ด้วย Display Update Virtual Channel Extension ([MS-RDPEDISP])) โหมดการใช้หน้าจอร่วมกันที่อนุญาตได้แก่: * mirror-primary - บันทึกจอภาพหลักของเซสชันผู้ใช้ปัจจุบัน * extend - สร้างจอภาพเสมือนใหม่และใช้จอภาพนั้นสำหรับเซสชันเดสก์ท็อประยะไกล ความละเอียดของจอภาพเสมือนนี้จะมาจากการกำหนดค่าจอภาพ และจะถูกอ่านโดยไคลเอนต์เดสก์ท็อประยะไกล

source: Path to the certificate file
kk: Сертификат файлына дейінгі жол
ml: സർട്ടിഫിക്കറ്റ് ഫയലിലേക്കുള്ള വഴി
sr@latin: Putanja do datoteke sertifikata
th: พาธไปยังไฟล์ใบรับรอง

source: In order to be able to use RDP with TLS Security, both the private key file and the certificate file need to be provided to the RDP server.
kk: TLS Security көмегімен RDP пайдалану мүмкіндігі үшін жеке кілт файлын да, сертификат файлын да RDP серверіне ұсыну қажет.
ml: TLS സുരക്ഷയ്‌ക്കൊപ്പം RDP ഉപയോഗിക്കുന്നതിന്, സ്വകാര്യ കീ ഫയലും സർട്ടിഫിക്കറ്റ് ഫയലും RDP സെർവറിന് നൽകേണ്ടതുണ്ട്.
sr@latin: Da biste koristili RDP sa TLS bezbednošću, morate dati i datoteku privatnog ključa i datoteku sertifikata RDP serveru.
th: เพื่อให้สามารถใช้ RDP พร้อมการรักษาความปลอดภัย TLS ได้ ทั้งไฟล์คีย์ส่วนตัวและไฟล์ใบรับรองจะต้องระบุให้กับเซิร์ฟเวอร์ RDP

source: Path to the private key file
kk: Жеке кілт файлына дейінгі жол
ml: Private കീ ഫയലിലേക്കുള്ള വഴി
sr@latin: Putanja do datoteke privatnog ključa
th: พาธไปยังไฟล์คีย์ส่วนตัว

source: Only allow remote connections to view the screen content
kk: Қашықтағы байланыстарға экран мазмұнын тек көруге рұқсат ету
ml: സ്‌ക്രീൻ ഉള്ളടക്കം കാണാൻ മാത്രം റിമോട്ട് കണക്ഷനുകളെ അനുവദിക്കുക
sr@latin: Samo dozvoli udaljenim vezama pregledanje sadržaja ekrana
th: อนุญาตให้การเชื่อมต่อระยะไกลเท่านั้นสามารถดูเนื้อหาหน้าจอได้

source: When view-only is true, remote RDP connections cannot manipulate input devices (e.g. mouse and keyboard).
kk: Тек карау режимінде, қашықтағы RDP байланыстары енгізу құрылғыларын басқара алмайды (мысалы, тышқан мен пернетақта).
ml: കാഴ്ച-മാത്രം ശരിയാണെങ്കിൽ, വിദൂര RDP കണക്ഷനുകൾക്ക് ഇൻപുട്ട് ഉപകരണങ്ങൾ കൈകാര്യം ചെയ്യാൻ കഴിയില്ല (ഉദാ. മൗസും കീബോർഡും).
sr@latin: Kada je samo gledanje omogućeno, udaljene RDP veze ne mogu koristiti ulazne uređaje (npr.: miša i tastaturu).
th: เมื่อ view-only เป็น true การเชื่อมต่อ RDP ระยะไกลจะไม่สามารถจัดการกับอุปกรณ์อินพุต (เช่น เมาส์และแป้นพิมพ์) ได้

source: Allowed authentication methods
kk: Рұқсат етілген аутентификация әдістері

source: Allowed authentication methods. Multiple may be selected to allow different authentication mechanisms. At least one authentication method must be selected.
kk: Рұқсат етілген аутентификация әдістері. Әртүрлі аутентификация механизмдерін қолдану үшін бірнешеуін таңдауға болады. Кем дегенде бір аутентификация әдісі таңдалуы тиіс.

source: A path to a Kerberos keytab file
kk: Kerberos keytab файлына жол

source: When 'kerberos' is enabled as an authentication method, the TERMSRV Kerberos service principal in this keytab file will be used for authentication.
kk: 'kerberos' аутентификация әдісі ретінде іске қосылған кезде, аутентификация үшін осы keytab файлындағы TERMSRV Kerberos сервис принципалы қолданылады.

source: The port used by the VNC server
kk: VNC сервері пайдаланатын порт
ml: VNC സെർവർ ഉപയോഗിക്കുന്ന പോർട്ട്
sr@latin: Ovaj port koristi VNC server
th: พอร์ตที่ใช้โดยเซิร์ฟเวอร์ VNC

source: The VNC client will connect to this port to use this VNC server.
kk: VNC клиенті осы VNC серверін пайдалану үшін осы портқа қосылады.
ml: ഈ VNC സെർവർ ഉപയോഗിക്കുന്നതിന് VNC ക്ലയൻ്റ് ഈ പോർട്ടിലേക്ക് കണക്റ്റുചെയ്യും.
sr@latin: VNC klijent će se povezati na ovaj port kada koristi VNC server.
th: ไคลเอนต์ VNC จะเชื่อมต่อกับพอร์ตนี้เพื่อใช้เซิร์ฟเวอร์ VNC นี้

source: Search a different VNC port if the configured one is used
kk: Егер бапталған порт пайдаланылып тұрса, басқа VNC портын іздеу
ml: കോൺഫിഗർ ചെയ്ത ഒന്ന് ഉപയോഗിക്കുകയാണെങ്കിൽ മറ്റൊരു VNC പോർട്ട് തിരയുക
sr@latin: Potražite drugi VNC port ukoliko je podešeni port zauzet
th: ค้นหาพอร์ต VNC อื่นถ้าพอร์ตที่กำหนดค่าถูกใช้ไปแล้ว

source: When negotiate-port is set to 'true' the VNC server will attempt to listen to the first available of the next 10 ports starting from the configured one.
kk: 'negotiate-port' мәні 'true' етіп орнатылғанда, VNC сервері бапталған порттан бастап келесі 10 порттың ішіндегі бірінші қолжетімдісін тыңдауға тырысады.
ml: egotiate-port 'true'മായി സജ്ജമാക്കുമ്പോൾ, കോൺഫിഗർ ചെയ്ത ഒന്നിൽ നിന്ന് ആരംഭിക്കുന്ന അടുത്ത 10 പോർട്ടുകളിൽ ലഭ്യമായ ആദ്യത്തേത് കേൾക്കാൻ വിഎൻസി സെർവർ ശ്രമിക്കും.
sr@latin: Ukoliko je „negotiate-port“ postavljen na „true“, VNC server će pokušati da sluša prvi slobodni koji se nalazi u narednih 10 portova od podešenog.
th: เมื่อ negotiate-port ตั้งค่าเป็น 'true' เซิร์ฟเวอร์ VNC จะพยายามฟังพอร์ต 10 พอร์ตถัดไปชุดแรกที่พร้อมใช้งาน โดยเริ่มจากพอร์ตที่กำหนดค่าไว้

source: Whether the VNC backend is enabled or not
kk: VNC бэкенді іске қосылған ба, жоқ па
ml: VNC ബാക്കെൻഡ് പ്രവർത്തനക്ഷമമാക്കിയാലും ഇല്ലെങ്കിലും
sr@latin: Da li je VNC pozadinac omogućen ili ne
th: กำหนดว่าจะเปิดใช้งานแบ็กเอนด์ VNC หรือไม่

source: If set to 'true' the VNC backend will be initialized.
kk: Егер 'true' мәніне орнатылса, VNC бэкенді инициализацияланады.
ml: 'true' എന്ന് ക്രമീകരിച്ചാൽ VNC ബാക്ക് എൻഡ് ആരംഭിക്കും.
sr@latin: Ako je podešeno na „true“, VNC pozadinac biće podešen.
th: ถ้าตั้งค่าเป็น 'true' แบ็กเอนด์ VNC จะถูกตั้งต้น

source: When view-only is true, remote VNC connections cannot manipulate input devices (e.g. mouse and keyboard).
kk: Тек карау режимінде, қашықтағы VNC байланыстары енгізу құрылғыларын басқара алмайды (мысалы, тышқан мен пернетақта).
ml: വ്യൂ-മാത്രം ശരിയാകുമ്പോൾ, വിദൂര VNC കണക്ഷനുകൾക്ക് ഇൻപുട്ട് ഉപകരണങ്ങൾ കൈകാര്യം ചെയ്യാൻ കഴിയില്ല (ഉദാ. മൗസ്, കീബോർഡ്).
sr@latin: Kada je samo gledanje omogućeno, udaljene VNC veze ne mogu koristiti ulazne uređaje (npr.: miša i tastaturu).
th: เมื่อ view-only เป็น true การเชื่อมต่อ VNC ระยะไกลจะไม่สามารถจัดการกับอุปกรณ์อินพุต (เช่น เมาส์และแป้นพิมพ์) ได้

source: Method used to authenticate VNC connections
kk: VNC байланыстарын аутентификациялау үшін қолданылатын әдіс
ml: VNC കണക്ഷനുകൾ ആധികാരികമാക്കാൻ ഉപയോഗിക്കുന്ന രീതി
sr@latin: Način potvrde identiteta VNC veza
th: วิธีการที่ใช้ยืนยันตัวตนการเชื่อมต่อ VNC
